<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Intel dmg for Tropy.
		The architecture can be set to arm64 if you change the "REGEX" variable to ^tropy-.*?-arm64\.dmg$. For example: -k REGEX="^tropy-.*?-arm64\.dmg$"
		Note: Finder can interpret the cache folder as a Tropy project. You can access the folder through Terminal, script or change the foldername extension from "*.tropy".</string>
		<key>Identifier</key>
		<string>com.github.pandemicus-recipes.download.tropy</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Tropy</string>
			<key>REGEX</key>
			<string>^tropy-[0-9.]+\.dmg$</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>github_repo</key>
					<string>tropy/tropy</string>
					<key>asset_regex</key>
					<string>%REGEX%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Tropy.app</string>
					<key>requirement</key>
					<string>identifier "org.tropy.tropy" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8LAYR367YV"</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>