<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Builds a .pkg for Tropy.
		The architecture can be set to arm64 if you change the "REGEX" variable to ^tropy-.*?-arm64\.dmg$. For example: -k REGEX="^tropy-.*?-arm64\.dmg$"
		Note: Finder can interpret the cache folder as a Tropy project. You can access the folder through Terminal, script or change the foldername extension from "*.tropy".</string>
		<key>Identifier</key>
		<string>com.github.pandemicus-recipes.pkg.tropy</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Tropy</string>
			<key>REGEX</key>
			<string>^tropy-[0-9.]+\.dmg$</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.pandemicus-recipes.download.tropy</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>755</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%NAME%.app</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%pathname%/%NAME%.app</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>id</key>
						<string>com.tropy.tropy.pkg</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
		</array>
	</dict>
</plist>