<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of DOTE. Modify the ARCHITECTURE key to determine whether the Intel (x64) or Apple Silicon (arm64) version
		is downloaded. Defaults to Intel if not overridden.	Eg. --key ARCHITECTURE=arm64</string>
		<key>Identifier</key>
		<string>com.github.pandemicus-recipes.download.DOTE</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DOTE</string>
			<key>ARCHITECTURE</key>
			<string>x64</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>github_repo</key>
					<string>BigSoftVideo/DOTE</string>
					<key>asset_regex</key>
					<string>DOTE-osx-%ARCHITECTURE%-.*?\.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/%NAME%.app</string>
					<key>requirement</key>
					<string>identifier "dk.aau.dote" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = A6V8WPHL77</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>