<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Creates a .pkg for DOTE. Modify the ARCHITECTURE key to determine whether the Intel (x64) or Apple Silicon (arm64) version
		is downloaded. Defaults to Intel if not overridden.	Eg. --key ARCHITECTURE=arm64</string>
		<key>Identifier</key>
		<string>com.github.pandemicus-recipes.pkg.DOTE</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DOTE</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.pandemicus-recipes.download.DOTE</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>