Description: Downloads the latest version of DOTE. Modify the ARCHITECTURE key to determine if the Intel (x64) or Apple Silicon (arm64) version is downloaded. 
  For example "--key ARCHITECTURE=arm64". Defaults to Intel if not overridden. 
Identifier: com.github.pandemicus-recipes.download.DOTE
MinimumVersion: '2.3'

Input:
  ARCHITECTURE: x64
  NAME: DOTE

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: DOTE-osx-%ARCHITECTURE%-.*?\.dmg
      github_repo: BigSoftVideo/DOTE

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/DOTE.app'
      requirement: identifier "dk.aau.dote" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = A6V8WPHL77
